// app.js

// 章节数据
const chaptersData = [
  {
    id: 1,
    title: "序言",
    content: "昨天8月9号下午，弟弟和我視频一个多小时，谈及了父亲，母亲以及他们的一生之路，许多他都不知道，因为弟弟是我们中最小的一个，和我姐姐相差二十一岁。他想让我将我知道的记忆中的家事用文字的形式记载下来，以便后人了解自己的祖辈，以便记念。\n\n对于这件事多年前我便有此意，只是一来我觉的只有我在意父母之事，况各人心中都有各人心中的父母形像；二来我由于只有初中文化程度，文学功底不足并且因职业原因，几十年和十个阿拉伯数字打交道，将可怜的文字基础丢失了大半，担心写不成个样子，所以几次拿起笔又放下，一直耽搁自今。既然弟弟很愿意了解父母的从前并且说晚辈们也同样想了解祖辈之经历，那我便将我所知道的父母所经所历以及我对父母的理解记彔下来，供我的哥哥，姐姐和弟弟以及我的晚辈们了解一下，但绝不想占用大伙的有用时光，没时间不感兴味的实在不想浪费你们的时间，只为给自己一个交待！"
  },
  {
    id: 2,
    title: "一.记忆中的爷爷奶奶",
    content: "我爷爷石继业，代县麻仙巷石家之子，旧社会走口外做生意（买卖）人，家庭殷实，当时社会算是好人家。我奶奶曹氏，代县城琉璃井大街曹家大院曹家独女，奶奶家有几个兄弟，留一个在家管理，其他都走口外做生意，也是当时时代的上等人家。因家中只有一个女儿多有宠爱，家人给她左挑又选后嫁给了我爷爷，当时算大龄女儿，也算门当户对。可好景不长，奶奶生下我父亲未满三岁，我爷爷就英年早逝，留下我奶奶孤儿寡母，家中又有个后婆婆（爷爷的继母），她乘我奶奶回娘家小住便把我奶奶的洋柜（旧时大衣柜）开了，把柜子里我奶奶的钱财衣物布匹一扫而光，为此我奶奶的兄弟替她打官司，后虽赢了官司，可我奶奶也回不去石家了，后来将我父亲寄养娘家，由曹家的老娘舅舅养育，奶奶便改嫁上门王村王家，后来奶奶去王家后又生了一个儿子后，也没能和王家男人白头，那王家男人也中年夭折。留下我奶奶守寡至终。"
  },
  {
    id: 3,
    title: "二.父亲的童年",
    content: "父亲石培德，字敏亭，小名明明。奶奶改嫁后，父亲便过上了寄人篱下的生活，不过父亲从小聪慧懂事，所以老娘舅舅家一家人对他很是亲近关心，供他儿时进旧时私塾学堂读书两年半，只两年半，父亲就能通读当时的四书五经等各种文言文板本的书籍，并能挥毫一笔好然。\n\n至此虽然生活还算顺当，但有自知之明的父亲自知自己毕竟不是曹家之子，不能理所当然的继续深造，因为除日常生活用度外上私熟更要花钱的。\n\n在他十六岁那年便自己找了个工作（当时的时代叫住地方）即打童工，从给掌柜（店主）子提茶壶倒夜壶打一切杂工做起，开始自食其力，结存今后的生活之余。由于父亲的眼活、勤奋、吃苦、耐劳、好学，很受当时的陆陈行（粮店）刘掌柜的看好，就将自己一手九九归一法的好算盘授于父亲，从此父亲便有了养生的一技之长，以至成为当时代州商介传诵四方的四架算盘之一的一把手。"
  },
  {
    id: 4,
    title: "三.父亲的婚姻",
    content: "刘掌柜，代县下阳阁村人，不仅教会父亲一手好算盘技术，并且把自己村闫家老三寡妇之女闫兰兰媒说给父亲（母亲也是从小没有了父亲，跟随我老娘和舅舅相依为命，也靠着老娘跟自己娘家的互助苦度年月，老娘二十八岁死了丈夫一直守寡终老，是村里公认的贤惠女人）。父亲是个特别有志气的人，虽然自己孤苦，可还有一个亲生母亲，但是母亲改嫁王家，而王家男主却非常吝啬，知道奶奶前边有个儿子，就刻薄更胜，奶奶做鞋子用九寸布人家就不给买一尺布，至使我奶奶生活很不自主。所以父亲为了不给自己母亲为难，以至自己说親一事直瞒着他母亲，所有办婚礼的开销、安排事无具细均是自己亲历亲为，直到了婚娶那日按排专门的大马轿子車去接自己母亲来参加自己的婚礼，至使我奶奶当时内心五味杂陈泪沾巾；而我老娘家一直以为我父亲是无父无母的孤儿，却在婚后才知有个安好的婆婆。\n\n开始结婚父亲是在县城他老娘家附近租房居住，舅妈家表弟妺们常聚一齐，我母亲是个非常聪明、和善、懂礼之人，不长时间就和他们相处融洽，如同亲弟妹一样，获得婆舅母一家的看好非常。（即以后我们一直相交的舅爷家、表姑家。）"
  },
  {
    id: 5,
    title: "四.岳父门上安家",
    content: "父母婚后约一个月余，大概是1938年吧，日夲人打进中国一年后，闯入代县城，阳明堡等地，到处抓抢，当时青壮年东躲西藏人心慌慌，人们整天活在不安中。相对滹沱河南面的村庄比较安全些。当时的滹沱河夏天没有桥，冬天搭个简单的土木桥，过大河很不方便。所以受当时国运形势所迫，新婚不久的父母便弃城里祖籍，暂时奔向岳父岳母村下阳阁躲避。开始我母亲住娘家，父亲吃住刘掌柜家，给人家当长工。\n\n抗日一打八年，显然这样的日子不能长久，后来我老娘便向自家房后邻居家的约没有30㎡小房租用（即阳阁玉白父母之房），让我父母同住一处，而那房用現在的眼光看根夲就不能住人：土坑小的父亲伸不开腿，只能在晚上睡觉时在锅台上放一块木板以延长坑的长度，勉强能伸腿入睡，冬天冷的家中水瓮冻一圈冰，晚上的尿盆早上倒不净，这样的日子过了好几年，本村的房东就找过三家，哥哥姐姐就出生在寻房走院的不安定中。"
  },
  {
    id: 6,
    title: "五.白手起家的父亲",
    content: "此刻的我心情很难受，特心疼父亲从小无依无靠，本来石家祖上还有留下的三间西房，可倔强自立的父亲压根就不想要那些财产，硬是靠自己超一般人的努力奋斗，在代县第一批养了四套大馬車（即四匹马拉一架車），自己赶起马車做走水（买卖）。写到此不由的让我联想起电影《青松岭》中的車把式赶马車过杀虎口的惊险片断。\n\n父亲那几年赶着馬車跑长途从甲地购货卖往乙地，再从乙地购货卖入甲地。那些年的父亲夏天赤日炎炎挥汗如雨，冬天过冰茬水挨冻受饿，所吃之苦，所受之罪只有父亲知道。辛苦积攒几年买下了下阳阁楼子街西北角的院落，三间瓦房两间耳房，才给自己的妻子儿女有了个安定的家，并陆续买了二十八亩地，至此父亲总算安了个很平常的家。"
  },
  {
    id: 7,
    title: "六.母亲的娘家",
    content: "母亲的母亲，我老娘下庒常家女，非常出色：漂亮、聪明、能干积于一身，是一个让人一見就引人看重之人。旧社会庙院（各村唱戏的地方）前后中间都隔一道砖砌的花栏墙，看戏时女人只能在花栏墙后面，前面是男人的地方。一次看戏时，正好让老爷隔着花栏墙看見了老娘，这一看便非要娶老娘为妻，而老娘是金命，老爷是木命，可谓是金克木，大婚不合，可他们硬是逆命而定，果真还应命而老爷早逝。留下一儿一女，那年老娘二十八岁。老娘计划等给儿子娶妻，将女儿岀嫁后她再另行改嫁，然而自从有了我父亲这个女婿后就没了再嫁人的想法，因为当时社会普通人家的吃穿用都有了依靠，况我母亲是一个非常孝顺的女儿，处处为寡母着想，让父亲给家里买啥都有我老娘的一份。\n\n从我记亊开始，在我家吃闲饭的人很多：我老娘一年得有半年常在，舅舅每天不吃一顿也吃两顿，不过舅舅也帮我家种地干活，还有个大老爷弧身一人（我母亲的大伯）也常在我家吃饭，我母亲对谁都特别好，记得大老爷过大年时五天不来我家吃饭，我母亲就给他蒸便宜一大簸箕吃的让大老爷端走才放心。这些也是我父亲攒钱买地的原因，父亲说多买几亩田地不在乎多几个人的饭。这陆续买下的二十八亩田地的事实也垫下了成为土改把子主要原因。"
  },
  {
    id: 8,
    title: "七.外住户的悲惨",
    content: "下阳阁村住户闫姓是大户一家村，而姓石的只有我们一家单门小户。上年岁的人都知道：在那个年代，一个普通的外住户在村里很难第一代人能硬气立足，更何况我们的老娘是个寡妇，舅舅是个软弱的老好人，（从小没有父亲的男孩能硬气吗？）在那个笑贫恨富的年代，我父亲的成家立业的速度算是快的。所以引起一些人的眼红嫉妒：常受那些长舌头的背地里尖酸刻薄；常遭心术不正之人的暗地陷害。听姐姐说那些年我家的田地里常被挨着地的人家将他家地里的盐碱土铲到我家地里，父亲种地能吃苦不惜力，自然不会白受气，总会以牙还牙还回去。\n\n八年抗战胜利，代县较早解放，土改运动开始，外住户且没有保护伞的父亲当然的成为了村里那些先锋分子和小人们打击报复的对象，更有好意为救济母亲门上的亲戚家人而买的那二十八亩田地，成为了他们打压父亲的证据。他们用各种不当的非人手段打击父亲，后来母亲为了保护父亲，硬逼着父亲去口外躲避，同时去口外打拼。也好在适当的时机接她娘儿们岀去，并千叮咏万嘱咐，形势不变就别回来。\n\n无耐父亲离家出走了，家里的事便由母亲顶着。他们对着母亲时就好多了，一来母亲是本村的闺女且人缘又好；二来母亲是个很有肚量的女人：不就是分土地，要东西吗，身外之物他们要啥就给他们啥。使的本来就节俭的日子更显穷困。姐姐哥哥的童年就是在那种颠沛流离，惊吓不安的环境长大。给他们造成儿时的阴影，我记的哥哥总是不爱穿新衣服，母亲给他缝件新袄，他总是让姐姐先穿，稍旧点了他才穿。\n\n土改最后给我们家定了个中农的成份而结束。这就是父亲——一个做过童工、打过长工、毫无家祖底用的一段难忘的经历。第一代外住户的悲惨！"
  },
  {
    id: 9,
    title: "八.定居下阳阁村",
    content: "不负母亲所望，父亲在呼市（今呼和浩特市）打拼一度时期，赚取了一些钱财，购置了当时时尚的立式大衣柜。当时流通的货币是白洋，这种白洋一来携带不便，二来父亲是计划携带妻子儿女一起去呼市安家的，所以父亲将自己辛苦赚得的不少的血汗钱和购置的家具寄放在当时居住在呼市的我们石家的（叔伯）大伯娘家里。\n\n土改结束了，父亲也回家了，原本要带母亲和姐姐哥哥他们一起去呼市安家的，可是母亲舍不下自己的寡母。不想远去呼市定居。那时侯交通困难，往返一次口外得数月之久，而且携带白洋路上很不安全，丢财弃命绝对不是危言纵听。所以没去呼市安家的结果就是：父亲辛苦打拼赚得的钱物也被那呼市的大伯娘私吞了。\n\n土改后，新中国成立，国家逐步正规，落实各项政策，实行计划经济，各行各业百废待兴，人才是重要的资源，凭着父亲的名气，被当时的新髙供销社聘请去任会计，当时的供销社和粮站合并。这样父亲有了固定的工作，家慢慢就这样定了下来，家里地也少了，由母亲经营管理，舅舅常常帮助我家的农忙，父亲休息时就回家种地。后来粮站和供销社分家，父亲便转到了粮站工作，直至退休。\n\n大概是一九五八年吧，以乡镇成立人民公社，村里成立生产队，土地归集体所有，给社员按人头分及少部分自留地，社员劳动计工分，年终结算计价分粮，当时因父亲上班工作，不参加生产队劳功，我们家逐渐又添加了我和妹妹弟弟，我家只有母亲一个弱劳动力参加生产队的劳动，所挣工份不够分口粮钱，年终还得给队里交钱。\n\n我母亲特别会管理并给我们按排营生，在家中由母亲的安排下能干啥就干啥，大的带小的，从小就做些力所能及的营生：田地里用铁锹翻地·锄头锄草·春种夏锄薅苗秋收；跟着羊群拾羊糞，上坡下地闹（捡）柴禾，早上踏着露水挖野菜，傍晚田头道边铲草皮垫猪圈，我和哥哥挖苦莱到城里卖一斤3分钱，星期天顶着星星带着瞌睡去推碾，磨面；做饭，弟弟四五岁就会用两只小手搓板鱼鱼；闺女们也从小抽空帮母亲做些针线活，做鞋，纳鞋底，缝衣服，补袜子，拈线，扒绳什么的……。那时侯吃的是亲手种的粮食，亲自碾米磨的面；穿的戴的从头到脚都是母亲一针一线亲手缝制。我记得我很小的时母亲帶着我们晚上在煤油灯下做针线到生（天上那左下斜三颗右下斜三颗共六颗星俗称生的星星）快落到西边天涯时才睡觉。总之没有闲着的。长大些后在学校放假时也去生产队劳动挣工分。\n\n就这样在我们兄弟姐妹未成家前以事属户（家中没有男主参加农业劳动力的称呼）的属性在下阳阁村定居，成为了我们的籍贯。"
  },
  {
    id: 10,
    title: "九.乐善好施的母亲",
    content: "母亲生在下阳阁，长在下阳阁，终老在下阳阁村，终其一生在村里没有人说母亲不好的。\n\n当年我父母买的下阳阁楼子街西北角的一处房院，原主属蔡家，蔡家有一对老人没有住处，母亲便留他们一直住在自家的耳房中，直至二老终老，大概一住就是十几年吧，其间不但没收过房租，而是把他们当自家长辈对待，只要家中吃点改样较好的吃的、逢年过节更是给二老送去，同时二老有啥难处母亲都会给于帮助和接济。\n\n我小时侯，记得下阳阁有个三娃老人，别人都称她为疯三娃儿家，那些年我还没有上学，哥哥姐姐已上本村小学，那时的小学生一日三上学：早上、上午、下午。每天早上我帮娘烧火，水开后娘先灌几温壶水，再泼红面，泼猪食，然后再添水做早饭，半大锅水，半勺米，米熟时再加一碗面糊糊算是早上的稀饭，热半篦子前一天蒸便宜的窝窝，每天早上这时候，姐姐哥哥还没有下学，那三娃老人就来我家吃饭，母亲就给她盛上一碗稀饭，拿上一个窝头。然后母亲接着做营生，搓红面鱼鱼。老人吃喝完了就走了，很自然而然的。等会儿姐姐哥哥下学了，我们一家人才吃早饭。\n\n在我小时候，有一个白发种花（给小孩们接种天麻病疫苗的）老先生，每年后春初夏时节转村给小孩们胳膊上种花。我记的那年是给妹妹种花，等全村的孩子种完已是傍晚，他回不了家，而且也为便于第二天去邻近的下一个村，需要随住一个晚上，母亲便留他在我们家住下，并供他吃饭。\n\n母亲六十四岁那年，父亲病逝，之后的近二十年，母亲基本上是在我们兄妹家中生活，但每年夏天七月份要回村住一个多月，那些年我们村有一对孤寡老人，海全老汉·海全老人。那一对老人一辈子无儿无女，晚年生活自然凄凉，母亲便一回去就给那老人多有关怀接济，送给他们些吃的用的。特别是过八月十五前我们兄弟姐妹们给母亲送去月饼水果等一大堆，她总是早早就给居邻隔壁的人家分别送去，特别是海全老人家更是不能少。分送完了那些食品后，八月十五下午就去苑庄我姐姐家住一段时间。 这在那十几年已成为母亲的习惯。\n\n我没记的母亲去寺庙上过布施，但施舍穷困可怜人的小事是数不胜数的。母亲常教导我们：溜官害民的亊咱不做，欺贫敬富的事咱不能做！她身体力行的教我们要力所能及的关愛弱小，要帮助穷人，这是母亲留给我一辈子不忘的教诲，我也同样是这样践行的。"
  },
  {
    id: 11,
    title: "十.多灾多难的父亲",
    content: "真人看一个人，三岁看大，七岁至老。我是庸人看小的未来真不敢看，但返回头看自己的亲人还是真懂。父亲，从他从小寄人篱下长大，没有父母的关爱和呵护，他不得不时时处处靠着自己，逼迫自己快长大，早成人。凭着自己灵活的脑子，自立自强，吃苦耐劳，所以他参于过的行业多，路子广。早期人生奔波的经历造就了強势的性格——这个強势只是无论在哪里哪行干啥都比别人干的好！因而只要有他在的地方就能突显岀有他的存在，同时也造成了总有一些嫉贤妒能的小人的碍眼，结果就是父亲在每次政治运动中都被小人们借用政治运动的风势当成侧边球生拉硬拽的冤枉打击。特别是文化大革命中几个王八蛋对父亲进行了人生攻击，父亲实再受不了，自寻短见，未果。得到通知后是我去岗上粮站去看望父亲的，在那间宽大的办公室还有两个人，我看着父亲还肿着的脸，当即泪奔，哭诉在父亲身边。而那才是开始，后来又辗转下庄公社、又转自代县城。经过漫长的一次次的无数个日日夜夜摧残，父亲那干活不知什么是累的人身体垮了；被定了贪污罪，精神也垮了。\n\n后来被迫退款（母亲东奔西走借的钱）后父亲回家了，和我们说了前因后果，事实是被冤枉的，我们气极了，但干生气是没用的，必须翻案，最后由父亲将实际情况说清，由哥哥整理好要求重审平反的材料报到专案组，经我们多次的找人摧促，后来终由粮食局抽调确定内行人员，认真复查当时的价格变价的文件，结果终于查清，最终落实是他们认定错误，给于正式平反了。\n\n可人的身体经历了摧残，被病魔缠身，虽有哥哥的治疗，但仍在病榻上躺了两年，还是早早离逝，没享受到他本该享受的……\n\n作为子女我深深的能体会到，父亲一辈子所吃的苦，所受的罪，他完完全全是为了给我们这一大家子一个较好的生活状态，虽有时事于愿违，但他总是无怨无悔的吃苦。父亲上班时，因只有他一个人那点工资养我们一大家人，我们家姐弟几个又都上学，还有老娘奶奶也得他养活，为了省钱，每到冬天单位食堂几毛钱一天的饭莱也舍不得吃，从家里拿上几个菜饼饼，喝上碗炒面糊糊给自顶饭……\n\n这一篇我几次停笔写不下去了，难受的心如刀绞。也总觉得写不出真实完整的父亲，父亲的一生只有累！只有苦！只有难！父亲走的太早了，给我们留下了太多太多的遗憾！"
  },
  {
    id: 12,
    title: "十一.兴旺的门庭",
    content: "父亲非常严厉，他对我们要求很严，不想让我们有任何的不努力和不爭气，他常教育我们，每个人有多大本事吃多大的饭。他是这样说的，也是身体力行的这样身教我们的。外人对我们兄弟姐妹们的夸赞是他最大的欣慰！\n\n母亲柔弱的身体却特别有度量，有忍性，又特会给我们按排力所能及的实践，繁杂的家务劳动使我们的手脑得到锻炼。   父母互补的性格和他们不限的努力为我们姐弟五人打造了一个忙碌而温暖的大家庭。\n\n我们兄弟姐妹五个也没有辜负父母的教诲，在下阳阁村的同代人相比，我们是全员上学最多的。1957年，姐姐哥哥双双考入当时代县最高学府代县中学校。1963年哥哥考大学我考初中又双双被录取。那个年代的学校少，录取率特低，特别是大学。我哥哥被山西医学院录取，最先知道的是下庄公社一个叫马华龙的干部，他进城办事，顺便看到录取榜上有我哥哥的名字，他就专门绕道来我们村奔走相告。哥哥是下阳阁村有史以来第一个大学生，此时我们家在全村人的心中惬意默化的变化着。\n\n姐姐上初中，她是我们姐弟中的老大，她知道父亲挣的那些儿工资养活我们老小十来口人，供她和哥哥同时上中学实在困难，她便主动同学校办理了休学，一年后和姐夫候兆丰结婚，后由姐夫供她上完了初中，但晚了一年就赶上了政策的变化，学校动员应届生主动回村放弃深造，特别是要党团员带头，姐姐是团员，自然是回村放弃再上学了。后来她在双徐完小当代教，后又在本村当民办教师将近十年，所挣收入帮衬家中。这也使我能较顺利的和哥哥同时完成学业。\n\n我上初中，心中知道家中经济仍很紧张，所以尽量节衣宿食，那时我们学校每月6元钱的伙食费，我每月最多只用5元，星期天回家帮忙干活，返校时带一茶缸熬山药豆角就顶头天晚上和第二天早上两顿饭。而且每周的两顿馒头（两个大馒头）我都舍不得吃，只吃点莱汤，等星期天回家时就带回家中。并且在上学时，每周母亲都给我安排一周的活计，或纳一双鞋底，或带一斤麻扒绳，（给粮食局扒绳，一斤麻绳挣6角钱）。这样我也没耽误学业。我在班里一直保持前三名，并也加入了共青团。六六年我们毕业考试都过了，我成绩为班上第一名，正在准备中考时文化大革命开始了，来势汹汹，一切都乱了，毕业考试成绩也不算数了，天天跟着当时的《人民日报》《解放軍报》《红旗杂志》的头板社论，自动群发的成立红卫兵战斗队写大字报，贴大字报，学校的墙面上都贴滿了大字报，批判一些老师的资产阶级教育路线，批判一些好学生的只专不红，然后又走出校门，大串联，有徒步的，有乘火車的，走到哪儿住在哪儿，吃在哪儿，不管走到哪里都有红卫兵接待站，那时虽然乱了学校，可社会主义的治安非常好，走到哪里都特别安全。六七年至六八年我一直在村里参加劳功，六八年学挍招回我们几天，学校革命委员会给我们补发了一个没有学习成绩单的毕业证，我定格在一个特定的\"老三届\"的学历衘头。六九年七月经媒人介绍，家人做主，嫁给了当时在太原重机厂初上班的张建中。七0年我以婆家村的名额去太钢峨矿以民工的身份参于了当年的三线建设整五年。月工资34.50元，我每月给母亲20元，还父亲被冤退款所欠的债。\n\n妹妹上初中未毕业，赶上文革停学，在家参加生产队劳动，帮家中干各种杂活。\n\n文革十年，七六年恢复高考，七七年弟弟参加高考，他很争气，如愿考上了大学。\n\n我们家祖上积德，不负父母辛苦养育，家中两个男丁均为大学生，哥哥嫂子大学生，弟弟弟媳大学生，彻底改变了我家在村中的地位。更因为是哥嫂是正牌名医，又在代县医院工作，他们高超的医学技术，高尚的医德，受广大病患者的爱待，特别是下阳阁村的人们都受到过哥哥的救助，同时村里人也对我们家特别好，九一年哥哥嫂子在县城盖房，村里人自动组织大工小工帮工为哥哥盖好了一座院落五间大房，东西两面小房。\n\n现在在哥哥的拉引下，我们姐弟兄妹五家都在代县城住上了楼房，特别是弟弟一家走出代县，定居大同，步入首都北京！\n\n至此，父母的后代已有五十余人，十多个小家。虽然各家生活掺差不齐，但都在向上发展，特别是我弟弟的女儿，我父母亲最小的孙女是我们石家最大的骄傲，她考大学是浙江大学，大学毕业被特招硕博连读，现在是世界级髙级科学家，带领千人团队攻克科学高峰，他们的科研成果利国利民，惠及人口！\n\n最后祝我敬爱的父母亲在九泉之下安息！祝您们的在天之灵欣慰！\n\n2023.8月"
  },
  {
    id: 13,
    title: "后记",
    content: "感谢弟弟对我的提议和信任，使我再次拿起笔，完成了我多年的梦想，让我对父母的思念、感恩和感谢用文字的形式记载下来。作为父母的子女，我诚恳的希望父母的后代能理解并记住祖辈的艰辛，更希望父母的血缘晚辈能以祖辈的一路为磨刀石磨砺自己心灵的利器！能在如今瞬息万变的时代平稳站在大浪潮头不被淹没，能在滚滚历史的車轮中流下自己无憾的脚印！让我们祖辈的在天之灵能脚登莲蓬，笑望人生！\n\n2023.9月"
  }
];

App({
  globalData: {
    userInfo: null,
    openid: null,
    likeCount: 0,
    chaptersData: chaptersData,
    shouldJumpToFirstChapter: false
  },

  onLaunch() {
    // 初始化云开发
    if (!wx.cloud) {
      console.error('请使用 2.2.3 或以上的基础库以使用云能力');
    } else {
      wx.cloud.init({
        traceUser: true,
      });
    }



    // 获取用户信息
    this.getSetting();
  },



  getSetting() {
    wx.getSetting({
      success: res => {
        if (res.authSetting['scope.userInfo']) {
          wx.getUserInfo({
            success: res => {
              this.globalData.userInfo = res.userInfo;
              if (this.userInfoReadyCallback) {
                this.userInfoReadyCallback(res);
              }
            }
          });
        }
      }
    });
  },

  // 获取openid
  getOpenId() {
    return new Promise((resolve, reject) => {
      if (this.globalData.openid) {
        resolve(this.globalData.openid);
        return;
      }
      
      wx.cloud.callFunction({
        name: 'login',
        success: res => {
          this.globalData.openid = res.result.openid;
          resolve(res.result.openid);
        },
        fail: reject
      });
    });
  }
});